InformationRegisters/стомИзменяемыеНоменклатуройСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомИзменяемыеНоменклатуройСостояния</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>удалитьУдаляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДобавляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдаляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДобавляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/стомВидыРедактированияЭлементовКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыРедактированияЭлементовКарты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/стомЗубнаяКартаДокументы/Ext/Module.bsl
#Область ПодготовкаЗККЗаписи

Процедура УстановитьИзменяемыеНоменклатуройСостояния(СтруктураАдресЗК, ТаблицаНоменклатуры) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.ЗубВКарте,
	|	ТаблицаНоменклатуры.СегментВЗубе,
	|	ТаблицаНоменклатуры.Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.ЗубВКарте КАК ЗубВКарте,
	|	ТаблицаНоменклатуры.СегментВЗубе КАК СегментВЗубе,
	|	ТаблицаНоменклатуры.Номенклатура,
	|	стомИзменяемыеНоменклатуройСостояния.ДобавляемоеСостояние,
	|	стомИзменяемыеНоменклатуройСостояния.УдаляемоеСостояние
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стомИзменяемыеНоменклатуройСостояния КАК стомИзменяемыеНоменклатуройСостояния
	|		ПО ТаблицаНоменклатуры.Номенклатура = стомИзменяемыеНоменклатуройСостояния.Номенклатура
	|ГДЕ
	|	ТаблицаНоменклатуры.ЗубВКарте <> ЗНАЧЕНИЕ(Справочник.стомЗубыКарты.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗубВКарте,
	|	СегментВЗубе
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	СегментВЗубе";
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Результат = Запрос.Выполнить();
	
	ВыборкаЗубы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ВыборкаСегменты = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСегменты.Следующий() Цикл
			
			Сегменты = Неопределено;
			Если ЗначениеЗаполнено(ВыборкаСегменты.СегментВЗубе) Тогда 
				Сегменты = Новый Массив;
				Сегменты.Добавить(ВыборкаСегменты.СегментВЗубе);
			КонецЕсли;
			
			ВыборкаСостояния = ВыборкаСегменты.Выбрать();
			Пока ВыборкаСостояния.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаСостояния.ДобавляемоеСостояние) Тогда 
					стомЗубнаяКартаМетоды.УстановитьСостояние(
						СтруктураЗК, ВыборкаЗубы.ЗубВКарте, Сегменты, ВыборкаСостояния.ДобавляемоеСостояние);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаСостояния.УдаляемоеСостояние) Тогда 
					стомЗубнаяКартаМетоды.СнятьСостояние(
						СтруктураЗК, ВыборкаЗубы.ЗубВКарте, Сегменты, ВыборкаСостояния.УдаляемоеСостояние);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьШаблоныТаблицСостоянийВариантовОбозначений()
	
	ТаблицаВарианты = Новый ТаблицаЗначений;
	ТаблицаВарианты.Колонки.Добавить("ЗубВКарте",		Метаданные.РегистрыСведений.стомВариантыЗубов.Измерения.ЗубВКарте.Тип);
	ТаблицаВарианты.Колонки.Добавить("ВариантЗуба",		Метаданные.РегистрыСведений.стомВариантыЗубов.Измерения.ВариантЗуба.Тип);
	ТаблицаВарианты.Колонки.Добавить("Область",			Метаданные.РегистрыСведений.стомВариантыЗубов.Измерения.Область.Тип);
	ТаблицаВарианты.Колонки.Добавить("Конструкция",		Метаданные.РегистрыСведений.стомВариантыЗубов.Ресурсы.Конструкция.Тип);
	ТаблицаВарианты.Колонки.Добавить("ВидРедактирования", Новый ОписаниеТипов("ПеречислениеСсылка.стомВидыРедактированияЭлементовКарты"));
	
	ТаблицаСостояния = Новый ТаблицаЗначений;
	ТаблицаСостояния.Колонки.Добавить("ЗубВКарте",		Метаданные.РегистрыСведений.стомСостоянияЗубов.Измерения.ЗубВКарте.Тип);
	ТаблицаСостояния.Колонки.Добавить("СегментВЗубе",	Метаданные.РегистрыСведений.стомСостоянияЗубов.Измерения.СегментВЗубе.Тип);
	ТаблицаСостояния.Колонки.Добавить("СостояниеСегмента", Метаданные.РегистрыСведений.стомСостоянияЗубов.Измерения.СостояниеСегмента.Тип);
	ТаблицаСостояния.Колонки.Добавить("ВидРедактирования", Новый ОписаниеТипов("ПеречислениеСсылка.стомВидыРедактированияЭлементовКарты"));
	
	ТаблицаОбозначения = Новый ТаблицаЗначений;
	ТаблицаОбозначения.Колонки.Добавить("ЗубВКарте",		Метаданные.РегистрыСведений.стомОбозначенияЗубов.Измерения.ЗубВКарте.Тип);
	ТаблицаОбозначения.Колонки.Добавить("ОбозначениеЗуба",	Метаданные.РегистрыСведений.стомОбозначенияЗубов.Ресурсы.ОбозначениеЗуба.Тип);
		
	Возврат Новый Структура("Варианты, Состояния, Обозначения", ТаблицаВарианты, ТаблицаСостояния, ТаблицаОбозначения);
	
КонецФункции

Функция ПолучитьВариантыСостоянияОбозначенияНаДату(ЗубнаяКарта, Клиент, Дата = Неопределено, ВариантКарты = Неопределено, Документ = Неопределено) Экспорт
	
	ТаблицыВариантовСостоянийОбозначений = ПолучитьШаблоныТаблицСостоянийВариантовОбозначений();
	ТаблицаВарианты = ТаблицыВариантовСостоянийОбозначений.Варианты;
	ТаблицаСостояния = ТаблицыВариантовСостоянийОбозначений.Состояния;
	ТаблицаОбозначения = ТаблицыВариантовСостоянийОбозначений.Обозначения;
	
	Запрос = стомСтоматология.СформироватьЗапросАктуальныхВариантовСостояний(ЗубнаяКарта, Клиент, Дата, ВариантКарты, Документ);
	Результат = Запрос.ВыполнитьПакет();
		
	ВыборкаЗубы = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ВыборкаВарианты = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВарианты.Следующий() Цикл 
			
			Если ВыборкаВарианты.ВариантЗуба.Основной Тогда					
				СтрокаВариант = ТаблицаВарианты.Добавить();
				СтрокаВариант.ЗубВКарте = ВыборкаЗубы.ЗубВКарте;
				СтрокаВариант.ВариантЗуба = ВыборкаВарианты.ВариантЗуба;
				СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;					
			Иначе	
				ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаОбласти.Следующий() Цикл  
					СтрокаВариант = ТаблицаВарианты.Добавить();
					СтрокаВариант.ЗубВКарте = ВыборкаЗубы.ЗубВКарте;
					СтрокаВариант.ВариантЗуба = ВыборкаВарианты.ВариантЗуба;
					СтрокаВариант.Область = ВыборкаОбласти.Область;
					СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
				КонецЦикла;
			КонецЕсли;
					
		КонецЦикла; // Варианты
		
	КонецЦикла; // Зубы
		
	ВыборкаКонструкции = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонструкции.Следующий() Цикл
		
		ВыборкаВарианты = ВыборкаКонструкции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
		Если ВыборкаВарианты.Следующий() Тогда 
			
			ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаОбласти.Следующий() Тогда 
				
				ВыборкаЗубы = ВыборкаОбласти.Выбрать();
				Пока ВыборкаЗубы.Следующий() Цикл 
					
					СтрокаВариант = ТаблицаВарианты.Добавить();
					СтрокаВариант.ЗубВКарте = ВыборкаЗубы.ЗубВКарте;
					СтрокаВариант.ВариантЗуба = ВыборкаВарианты.ВариантЗуба;
					СтрокаВариант.Область = ВыборкаОбласти.Область;
					СтрокаВариант.Конструкция = ВыборкаКонструкции.Конструкция;
					СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
					
				КонецЦикла;
				
			КонецЕсли; // Области
				
		КонецЕсли; // Варианты
		
	КонецЦикла; // Конструкции
	
	// Установка состояний
	ВыборкаЗубы = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ВыборкаСостояния = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
		Пока ВыборкаСостояния.Следующий() Цикл
			
			ВыборкаСегменты = ВыборкаСостояния.Выбрать();
			Пока ВыборкаСегменты.Следующий() Цикл
				
				СтрокаСостояние = ТаблицаСостояния.Добавить();
				СтрокаСостояние.ЗубВКарте = ВыборкаЗубы.ЗубВКарте;
				СтрокаСостояние.СегментВЗубе = ВыборкаСегменты.СегментВЗубе;
				СтрокаСостояние.СостояниеСегмента = ВыборкаСостояния.СостояниеСегмента;
				СтрокаСостояние.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
				
			КонецЦикла;
			
		КонецЦикла; // Варианты
		
	КонецЦикла; // Зубы
	
	// Обозначения
	ВыборкаОбозначения = Результат[6].Выбрать();
	Пока ВыборкаОбозначения.Следующий() Цикл
		
		СтрокаОбозначение = ТаблицаОбозначения.Добавить();
		СтрокаОбозначение.ЗубВКарте = ВыборкаОбозначения.ЗубВКарте;
		СтрокаОбозначение.ОбозначениеЗуба = ВыборкаОбозначения.ОбозначениеЗуба;
		
	КонецЦикла;
	
	Возврат ТаблицыВариантовСостоянийОбозначений;
	
КонецФункции

Функция УстановленныеВариантыСостоянияОбозначенияВТаблицу(СтруктураАдресЗК) Экспорт
	
	ТаблицыВариантовСостоянийОбозначений = ПолучитьШаблоныТаблицСостоянийВариантовОбозначений();
	ТаблицаВарианты = ТаблицыВариантовСостоянийОбозначений.Варианты;
	ТаблицаСостояния = ТаблицыВариантовСостоянийОбозначений.Состояния;
	ТаблицаОбозначения = ТаблицыВариантовСостоянийОбозначений.Обозначения;
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		
		СтруктураЗуб = кзЗуб.Значение;
		
		СтрокаОбозначение = ТаблицаОбозначения.Добавить();
		СтрокаОбозначение.ЗубВКарте = СтруктураЗуб.ЗубВКарте;
		СтрокаОбозначение.ОбозначениеЗуба = СтруктураЗуб.Обозначение;
		
		Для Каждого кзВариант Из СтруктураЗуб.Варианты Цикл
			СтруктураВариант = кзВариант.Значение;
			
			Если СтруктураВариант.Конструкция Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Не СтруктураВариант.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтруктураВариант.Основной Тогда					
				СтрокаВариант = ТаблицаВарианты.Добавить();
				СтрокаВариант.ЗубВКарте = СтруктураЗуб.ЗубВКарте;
				СтрокаВариант.ВариантЗуба = СтруктураВариант.ВариантЗуба;
				СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;					
			Иначе	
				Для Каждого кзОбласть Из СтруктураВариант.Области Цикл 
					СтруктураОбласть = кзОбласть.Значение;
					Если Не СтруктураОбласть.Выбран Или СтруктураОбласть.Конструкция Тогда 
						Продолжить;
					КонецЕсли;
					
					СтрокаВариант = ТаблицаВарианты.Добавить();
					СтрокаВариант.ЗубВКарте = СтруктураЗуб.ЗубВКарте;
					СтрокаВариант.ВариантЗуба = СтруктураВариант.ВариантЗуба;
					СтрокаВариант.Область = СтруктураОбласть.Область;
					СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Состояния
		Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл 
			СтруктураТекСегмент = кзСегмент.Значение;
			Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
				СтруктураСостояние = кзСостояние.Значение;
				
				СтрокаСостояние = ТаблицаСостояния.Добавить();
				СтрокаСостояние.ЗубВКарте = СтруктураЗуб.ЗубВКарте;
				СтрокаСостояние.СегментВЗубе = СтруктураТекСегмент.СегментВЗубе;
				СтрокаСостояние.СостояниеСегмента = СтруктураСостояние.Состояние;
				СтрокаСостояние.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	// Конструкции
	Для Каждого кзКонструкция Из СтруктураЗК.Конструкции Цикл
		СтруктураКонструкция = кзКонструкция.Значение;
		Если СтруктураКонструкция.Удалена Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЗубВКарте Из СтруктураКонструкция.СоставЗубов Цикл 
			СтрокаВариант = ТаблицаВарианты.Добавить();
			СтрокаВариант.ЗубВКарте = ЗубВКарте;
			СтрокаВариант.ВариантЗуба = СтруктураКонструкция.Вариант;
			СтрокаВариант.Область = СтруктураКонструкция.Область;
			СтрокаВариант.Конструкция = СтруктураКонструкция.Конструкция;
			СтрокаВариант.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ТаблицыВариантовСостоянийОбозначений;
	
КонецФункции

Функция ПолучитьИзмененныеВариантыСостоянияОбозначения(СтруктураАдресЗК, ИсходнаяДата = Неопределено) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ИсходныеВариантыСостоянияОбозначения = ПолучитьВариантыСостоянияОбозначенияНаДату(
		СтруктураЗК.ЗубнаяКарта, СтруктураЗК.Клиент, ИсходнаяДата, СтруктураЗК.ВариантКарты, Неопределено);
		
	НовыеВариантыСостоянияОбозначения = УстановленныеВариантыСостоянияОбозначенияВТаблицу(СтруктураЗК);
	
	// Правильное количество вариантов - 33 (32 зуба и 1 полость)
	Если НовыеВариантыСостоянияОбозначения.Варианты.Количество() < 33 Тогда
		
		Для каждого СтрокаТаблИсходныхВар Из ИсходныеВариантыСостоянияОбозначения.Варианты Цикл
			
			//Зуб в карте универсальный способ определять строки
			ЗубИсходнВар = СтрокаТаблИсходныхВар.ЗубВКарте;
			
			СтрокаНовЗнач = НовыеВариантыСостоянияОбозначения.Варианты.Найти(ЗубИсходнВар, "ЗубВКарте");
			
			// Этот зуб не был утерян
			Если СтрокаНовЗнач <> Неопределено Тогда	
				Продолжить;	
			КонецЕсли;
			
			ЗаменяющаяСтрока = НовыеВариантыСостоянияОбозначения.Варианты.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаменяющаяСтрока,СтрокаТаблИсходныхВар);
			// состояния тоже могут быть утерены, проверяем мы их только в ситуации когда утерян вариант
			// Но если состояния и так не было - значит и не будет
			СтрокаНовСост = НовыеВариантыСостоянияОбозначения.Состояния.Найти(ЗубИсходнВар, "ЗубВКарте");
			СтрокаТаблИсходноеСост = ИсходныеВариантыСостоянияОбозначения.Состояния.Найти(ЗубИсходнВар, "ЗубВКарте");
			Если СтрокаНовСост <> Неопределено или СтрокаТаблИсходноеСост = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			ЗаменяющаяСтрока = НовыеВариантыСостоянияОбозначения.Состояния.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаменяющаяСтрока,СтрокаТаблИсходноеСост);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсходныеВарианты", ИсходныеВариантыСостоянияОбозначения.Варианты);
	Запрос.УстановитьПараметр("ИсходныеСостояния", ИсходныеВариантыСостоянияОбозначения.Состояния);
	Запрос.УстановитьПараметр("ИсходныеОбозначения", ИсходныеВариантыСостоянияОбозначения.Обозначения);
	Запрос.УстановитьПараметр("НовыеВарианты", НовыеВариантыСостоянияОбозначения.Варианты);
	Запрос.УстановитьПараметр("НовыеСостояния", НовыеВариантыСостоянияОбозначения.Состояния);
	Запрос.УстановитьПараметр("НовыеОбозначения", НовыеВариантыСостоянияОбозначения.Обозначения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходныеВарианты.ЗубВКарте,
	|	ИсходныеВарианты.ВариантЗуба,
	|	ИсходныеВарианты.Область,
	|	ИсходныеВарианты.Конструкция
	|ПОМЕСТИТЬ ИсходныеВарианты
	|ИЗ
	|	&ИсходныеВарианты КАК ИсходныеВарианты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеВарианты.ЗубВКарте,
	|	НовыеВарианты.ВариантЗуба,
	|	НовыеВарианты.Область,
	|	НовыеВарианты.Конструкция
	|ПОМЕСТИТЬ НовыеВарианты
	|ИЗ
	|	&НовыеВарианты КАК НовыеВарианты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеСостояния.ЗубВКарте,
	|	ИсходныеСостояния.СегментВЗубе,
	|	ИсходныеСостояния.СостояниеСегмента
	|ПОМЕСТИТЬ ИсходныеСостояния
	|ИЗ
	|	&ИсходныеСостояния КАК ИсходныеСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеСостояния.ЗубВКарте,
	|	НовыеСостояния.СегментВЗубе,
	|	НовыеСостояния.СостояниеСегмента
	|ПОМЕСТИТЬ НовыеСостояния
	|ИЗ
	|	&НовыеСостояния КАК НовыеСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеОбозначения.ЗубВКарте,
	|	ИсходныеОбозначения.ОбозначениеЗуба
	|ПОМЕСТИТЬ ИсходныеОбозначения
	|ИЗ
	|	&ИсходныеОбозначения КАК ИсходныеОбозначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеОбозначения.ЗубВКарте,
	|	НовыеОбозначения.ОбозначениеЗуба
	|ПОМЕСТИТЬ НовыеОбозначения
	|ИЗ
	|	&НовыеОбозначения КАК НовыеОбозначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИсходныеВарианты.ЗубВКарте, НовыеВарианты.ЗубВКарте) КАК ЗубВКарте,
	|	ЕСТЬNULL(ИсходныеВарианты.ВариантЗуба, НовыеВарианты.ВариантЗуба) КАК ВариантЗуба,
	|	ЕСТЬNULL(ИсходныеВарианты.Область, НовыеВарианты.Область) КАК Область,
	|	ЕСТЬNULL(ИсходныеВарианты.Конструкция, НовыеВарианты.Конструкция) КАК Конструкция,
	|	ВЫБОР
	|		КОГДА ИсходныеВарианты.ЗубВКарте ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|		КОГДА НовыеВарианты.ЗубВКарте ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Удаление)
	|	КОНЕЦ КАК ВидРедактирования
	|ИЗ
	|	ИсходныеВарианты КАК ИсходныеВарианты
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеВарианты КАК НовыеВарианты
	|		ПО ИсходныеВарианты.ЗубВКарте = НовыеВарианты.ЗубВКарте
	|			И ИсходныеВарианты.ВариантЗуба = НовыеВарианты.ВариантЗуба
	|			И ИсходныеВарианты.Область = НовыеВарианты.Область
	|			И ИсходныеВарианты.Конструкция = НовыеВарианты.Конструкция
	|ГДЕ
	|	(ИсходныеВарианты.ЗубВКарте ЕСТЬ NULL
	|			ИЛИ НовыеВарианты.ЗубВКарте ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИсходныеСостояния.ЗубВКарте, НовыеСостояния.ЗубВКарте) КАК ЗубВКарте,
	|	ЕСТЬNULL(ИсходныеСостояния.СегментВЗубе, НовыеСостояния.СегментВЗубе) КАК СегментВЗубе,
	|	ЕСТЬNULL(ИсходныеСостояния.СостояниеСегмента, НовыеСостояния.СостояниеСегмента) КАК СостояниеСегмента,
	|	ВЫБОР
	|		КОГДА ИсходныеСостояния.ЗубВКарте ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|		КОГДА НовыеСостояния.ЗубВКарте ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Удаление)
	|	КОНЕЦ КАК ВидРедактирования
	|ИЗ
	|	ИсходныеСостояния КАК ИсходныеСостояния
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеСостояния КАК НовыеСостояния
	|		ПО ИсходныеСостояния.ЗубВКарте = НовыеСостояния.ЗубВКарте
	|			И ИсходныеСостояния.СегментВЗубе = НовыеСостояния.СегментВЗубе
	|			И ИсходныеСостояния.СостояниеСегмента = НовыеСостояния.СостояниеСегмента
	|ГДЕ
	|	(ИсходныеСостояния.ЗубВКарте ЕСТЬ NULL
	|			ИЛИ НовыеСостояния.ЗубВКарте ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеОбозначения.ЗубВКарте,
	|	НовыеОбозначения.ОбозначениеЗуба
	|ИЗ
	|	НовыеОбозначения КАК НовыеОбозначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеОбозначения КАК ИсходныеОбозначения
	|		ПО ИсходныеОбозначения.ЗубВКарте = НовыеОбозначения.ЗубВКарте
	|ГДЕ
	|	(ИсходныеОбозначения.ЗубВКарте ЕСТЬ NULL
	|			ИЛИ ИсходныеОбозначения.ОбозначениеЗуба <> НовыеОбозначения.ОбозначениеЗуба)";
	Результат = Запрос.ВыполнитьПакет();
	
	ИзмененныеВарианты = Результат[6].Выгрузить();
	ИзмененныеСостояния = Результат[7].Выгрузить();
	ИзмененныеОбозначения = Результат[8].Выгрузить();
	
	Возврат Новый Структура("Варианты, Состояния, Обозначения", ИзмененныеВарианты, ИзмененныеСостояния, ИзмененныеОбозначения);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

Процедура стомДокументыЗКПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗубнаяКартаАдрес = Неопределено;
	Если Не Источник.ДополнительныеСвойства.Свойство("ЗубнаяКартаАдрес", ЗубнаяКартаАдрес) Тогда 
		Возврат;
	КонецЕсли;
	
	Источник.стомУстановленныеВарианты.Очистить();
	Источник.стомУстановленныеСостояния.Очистить();
	
	Если Не ЗначениеЗаполнено(ЗубнаяКартаАдрес) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Прием") Тогда
		УстановитьИзменяемыеНоменклатуройСостояния(ЗубнаяКартаАдрес, Источник.Работы.Выгрузить(,"Номенклатура, ЗубВКарте, СегментВЗубе"));
	КонецЕсли;
	
	ГраницаПрием = Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая);
	
	ИзмененныеВариантыСостоянияОбозначения = стомЗубнаяКартаДокументы.ПолучитьИзмененныеВариантыСостоянияОбозначения(ЗубнаяКартаАдрес, ГраницаПрием);
	
	Источник.стомУстановленныеВарианты.Загрузить(ИзмененныеВариантыСостоянияОбозначения.Варианты);
	Источник.стомУстановленныеСостояния.Загрузить(ИзмененныеВариантыСостоянияОбозначения.Состояния);
	Источник.ДополнительныеСвойства.Вставить("ИзмененныеОбозначенияЗубов", ИзмененныеВариантыСостоянияОбозначения.Обозначения);
	
КонецПроцедуры

Процедура стомДокументыЗКОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт	
	
	Если Источник.Движения.Найти("стомЗначенияПараметровЗубнойФормулы") <> Неопределено Тогда
		Источник.Движения.стомЗначенияПараметровЗубнойФормулы.Записывать = Истина;
		Для Каждого СтрокаПараметр Из Источник.стомПараметрыЗубнойФормулы Цикл
			Движение = Источник.Движения.стомЗначенияПараметровЗубнойФормулы.Добавить();
			Движение.Регистратор = Источник.Ссылка;
			Движение.Период = Источник.Дата;
			Движение.Клиент = Источник.Клиент;
			Движение.ЗубнаяКарта = Источник.ЗубнаяКарта;
			Движение.ЗубВКарте = СтрокаПараметр.ЗубВКарте;
			Движение.СегментВЗубе = СтрокаПараметр.СегментВЗубе;
			Движение.Параметр = СтрокаПараметр.Параметр;
			Движение.Значение = СтрокаПараметр.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Источник.Движения.стомСостоянияЗубов.Записывать = Истина;
	Для Каждого СтрокаСостояние Из Источник.стомУстановленныеСостояния Цикл
		Движение = Источник.Движения.стомСостоянияЗубов.Добавить();
		Движение.Регистратор = Источник.Ссылка;
		Движение.Клиент = Источник.Клиент;
		Движение.Период = Источник.Дата;
		Движение.ЗубнаяКарта = Источник.ЗубнаяКарта;
		Движение.ЗубВКарте = СтрокаСостояние.ЗубВКарте;
		Движение.СегментВЗубе = СтрокаСостояние.СегментВЗубе;
		Движение.СостояниеСегмента = СтрокаСостояние.СостояниеСегмента;
		Движение.ВидРедактирования = СтрокаСостояние.ВидРедактирования;
	КонецЦикла;
	
	Источник.Движения.стомВариантыЗубов.Записывать = Истина;
	Для Каждого СтрокаВариант Из Источник.стомУстановленныеВарианты Цикл
		Движение = Источник.Движения.стомВариантыЗубов.Добавить();
		Движение.Регистратор = Источник.Ссылка;
		Движение.Клиент = Источник.Клиент;
		Движение.Период = Источник.Дата;
		Движение.ЗубнаяКарта = Источник.ЗубнаяКарта;
		Движение.ЗубВКарте = СтрокаВариант.ЗубВКарте;
		Движение.ВариантЗуба = СтрокаВариант.ВариантЗуба;
		
		Движение.Область = СтрокаВариант.Область;
		
		Движение.Конструкция = СтрокаВариант.Конструкция;
		Движение.ВидРедактирования = СтрокаВариант.ВидРедактирования;
	КонецЦикла;
	
	//установка обозначений зубов
	Если Источник.ДополнительныеСвойства.Свойство("ИзмененныеОбозначенияЗубов") Тогда 
		
		Источник.Движения.стомОбозначенияЗубов.Записывать = Истина;
		Для Каждого СтрокаОбозначение Из Источник.ДополнительныеСвойства.ИзмененныеОбозначенияЗубов Цикл 
			Движение = Источник.Движения.стомОбозначенияЗубов.Добавить();
			Движение.Регистратор = Источник.Ссылка;
			Движение.Период = Источник.Дата;
			Движение.Клиент = Источник.Клиент;
			Движение.ЗубнаяКарта = Источник.ЗубнаяКарта;
			Движение.ЗубВКарте = СтрокаОбозначение.ЗубВКарте;
			Движение.ОбозначениеЗуба = СтрокаОбозначение.ОбозначениеЗуба;
			Движение.ВариантКарты = Источник.ВариантЗубнойКарты; //для контроля смены варианта карты
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Стом_СправочникиПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	
	// Не позволяем создавать новые элементы справочников, если у пользователя нет
	// доступа к их редактированию
	Если Не Источник.ОбменДанными.Загрузка
		И Не ОбщегоНазначенияСервер.РежимРасширенныхВозможностейРедактированияДанных() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Элементы данного справочника не редактируются пользователями.'"));	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура Стом_СправочникиПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	
	// Не позволяем удалять элементы справочников, если у пользователя нет
	// доступа к их редактированию
	Если Не Источник.ОбменДанными.Загрузка
		И Не ОбщегоНазначенияСервер.РежимРасширенныхВозможностейРедактированияДанных() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Элементы данного справочника не редактируются пользователями.'"));	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
